/********************************************************************
Ïðîåêò:     Êîìïëåêò ÏÎ äëÿ ëàáîðàòîðíûõ ðàáîò ïî òåìå
"Ðåàëèçàöèÿ àñèììåòðè÷íûõ êðèïòîãðàôè÷åñêèõ àëãîðèòìîâ"
Ôàéë:       longdiv.h
Àâòîð:      Ãðóíòîâè÷ Ì.Ì.
Ñîäåðæàíèå: Èíòåðôåéñ ôóíêöèè äåëåíèÿ äëèííûõ ÷èñåë
Îïèñàíèå:   Íåîáõîäèìî
- ñêîïèðîâàòü ôàéëû longdiv.c è longdiv.h â êàòàëîã ïðîåêòà,
- äîáàâèòü ôàéë longdiv.c â ïðîåêò ëàáîðàòîðíîé ðàáîòû,
- âêëþ÷èòü ôàéë longdiv.h èíñòðóêöèåé
#include "longdiv.h"
â íà÷àëå ìîäóëÿ, èñïîëüçóþùåãî ôóíêöèþ äåëåíèÿ äëèííûõ ÷èñåë.
Èñòîðèÿ:    1998 - áàçîâàÿ âåðñèÿ
04.06.2005 - ïåðåñìîòðåííàÿ C-âåðñèÿ
*********************************************************************/
//#include "stdafx.h"

#define MAX_DIV_OPERAND_SIZE 32 /* íàèáîëüøèé ðàçìåð îïåðàíäîâ Div â öèôðàõ */


	/*--------------------------------------------------------
	Äåëåíèå äëèííûõ ÷èñåë Q = U/V, R = U % V
	Èñêëþ÷åíèå äåëåíèÿ íà 0 íå îáðàáàòûâàåòñÿ
	--------------------------------------------------------*/
	void Div(
		const unsigned short U[],   /* äåëèìîå (sizeU öèôð) */
		const unsigned short V[],   /* äåëèòåëü (sizeV öèôð) */
		unsigned short Q[],         /* ÷àñòíîå (sizeU öèôð), ì.á. NULL */
		unsigned short R[],         /* îñòàòîê (sizeV öèôð), ì.á. NULL */
		int sizeU,                  /* ðàçìåð ÷èñåë U è Q â öèôðàõ */
		int sizeV);                 /* ðàçìåð ÷èñåë V è R â öèôðàõ */



/*--------------------------------------------------------
Íàñòðîéêà ôóíêöèè Div.
MAX_DIV_OPERAND_SIZE - íàèáîëüøàÿ âîçìîæíàÿ â ïðîåêòå äëèíà àðãóìåíòîâ ôóíêöèè Div.
Ýòà êîíñòàíòà íåîáõîäèìà äëÿ ýôôåêòèâíîãî âûäåëåíèÿ ïàìÿòè â ôóíêöèè Div.
Îñòàâüòå åå áåç èçìåíåíèÿ, åñëè íå ïîíèìàåòå, ÷òî ýòî çíà÷èò.
--------------------------------------------------------*/

